---
kind: property
id: P:Autodesk.Revit.DB.DefinitionBindingMap.Item(Autodesk.Revit.DB.Definition)
source: html/32246a7a-2590-652b-0ea6-975b9101a327.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Item Property

## Syntax (C#)
```csharp
public virtual Binding this[
	Definition key
] { get; set; }
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`)